app/controllers/admin/apologizes_controller.rb

  def index
    @apologizes = Apologize.all
---
SELECT "apologizes".* FROM "apologizes"

  def create
    @apologize = Apologize.new(apologize_params)

      if @apologize.save
---
INSERT INTO "apologizes" ("apologize_image", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["apologize_image", "asdasd"], ["description", "asdasd"], ["author_id", 4], ["created_at", "2016-07-24 12:45:33.353357"], ["updated_at", "2016-07-24 12:45:33.353357"]]

  def update

      if @apologize.update(apologize_params)
---
UPDATE "apologizes" SET "apologize_image" = ?, "updated_at" = ? WHERE "apologizes"."id" = ?  [["apologize_image", "asdasdW"], ["updated_at", "2016-07-24 12:47:36.192491"], ["id", 1]]

  def destroy
    @apologize.destroy
---
DELETE FROM "apologizes" WHERE "apologizes"."id" = ?  [["id", 1]]

    def set_authors
      @authors = Author.all.collect{|author| [author.name, author.id]}
---
SELECT "authors".* FROM "authors"

    def set_apologize
      @apologize = Apologize.find(params[:id])
---
SELECT  "apologizes".* FROM "apologizes" WHERE "apologizes"."id" = ? LIMIT 1  [["id", 1]]