app/controllers/admin/authors_controller.rb

  def create
    @author = Author.new(author_params)

      if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Ricardo"], ["created_at", "2016-07-24 12:12:37.758006"], ["updated_at", "2016-07-24 12:12:37.758006"]]

  def update
      if @author.update(author_params)
---
UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "Ricardo@"], ["updated_at", "2016-07-24 12:20:18.530178"], ["id", 2]]

  def destroy
    @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]

    def set_author
      @author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]