app/controllers/home_controller.rb

  def index
    @apologize = Apologize.order("RANDOM()").first
---
SELECT  "apologizes".* FROM "apologizes"  ORDER BY "apologizes"."id" ASC LIMIT 1